Autodesk.Revit.DB.ViewTemplateApplicationOption
Options for applying view templates
Since:
2013
Since:
2013

Autodesk.Revit.DB.ViewTemplateApplicationOption.AllParametersAndStickIfNone
Apply all parameters controlled by template and if none is currently assigned make it view template

Autodesk.Revit.DB.ViewTemplateApplicationOption.UncontrolledParameters
Apply only parameters controlled by template and not controlled by currently assigned view template

Autodesk.Revit.DB.ViewTemplateApplicationOption.AllParameters
Apply all parameters controlled by template